import random



def generate_answer(text, topic="عمومی"):

    text = text.strip()



    answers = {


        "پهپاد و پرواز": [

            "یک پهپاد کشاورزی هوشمند بساز که وضعیت زمین را بررسی کند.",

            "یک پهپاد امدادگر بساز که در مناطق خطرناک کمک‌رسانی کند.",

            "یک کوادکوپتر هوشمند با تشخیص مسیر و جلوگیری از برخورد طراحی کن."

        ],



        "رباتیک": [

            "یک ربات خانگی هوشمند بساز که وسایل خانه را کنترل کند.",

            "یک ربات آموزشی بساز که به کودکان برنامه نویسی یاد بدهد.",

            "یک ربات با دوربین و هوش مصنوعی برای تشخیص محیط بساز."

        ],



        "هوش مصنوعی": [

            "یک دستیار هوشمند بساز که از تجربه‌های قبلی یاد بگیرد.",

            "یک سیستم تشخیص تصویر با یادگیری ماشین طراحی کن."

        ],



        "نجوم": [

            "یک سیستم رصد ستاره‌ها با سنسور و پردازش تصویر بساز.",

            "یک ربات کاوشگر فضایی برای بررسی سیارات طراحی کن."

        ],



        "برنامه نویسی": [

            "یک نرم افزار هوشمند بساز که مشکلات کاربران را حل کند.",

            "یک ابزار پایتونی برای مدیریت کارها طراحی کن."

        ],



        "عمومی": [

            "می‌توانم درباره این موضوع تحقیق کنم و بهتر یاد بگیرم."

        ]

    }



    if topic in answers:

        return random.choice(
            answers[topic]
        )



    return random.choice(
        answers["عمومی"]
    )
